bweiler/Skoobot-firmware/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_template/main.c
//stepping modes
#define FULL_STEP     0
#define HALF_STEP     1
#define QUARTER_STEP  2
#define n8_STEP       3
#define n16_STEP      4
#define n32_STEP      5

//BLE defines, refactored from SDK
#define APP_FEATURE_NOT_SUPPORTED       BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2    /**< Reply when unsupported features are requested. */

#define DEVICE_NAME                     "Skoobot"                               /**< Name of device. Will be included in the advertising data. */
#define MANUFACTURER_NAME               "William Weiler Eng"                    /**< Manufacturer. Will be passed to Device Information Service. */
#define APP_BLE_OBSERVER_PRIO           3                                       /**< Application's BLE observer priority. You shouldn't need to modify this value. */
#define APP_BLE_CONN_CFG_TAG            1                                       /**< A tag identifying the SoftDevice BLE configuration. */

#define SCAN_INTERVAL                   0x00A0                              /**< Determines scan interval in units of 0.625 millisecond. */
#define SCAN_WINDOW                     0x0050                              /**< Determines scan window in units of 0.625 millisecond. */
#define SCAN_TIMEOUT                    0x0000                              /**< Timout when scanning. 0x0000 disables timeout. */
#define MIN_CONNECTION_INTERVAL         MSEC_TO_UNITS(7.5, UNIT_1_25_MS)    /**< Determines minimum connection interval in milliseconds. */
#define MAX_CONNECTION_INTERVAL         MSEC_TO_UNITS(30, UNIT_1_25_MS)     /**< Determines maximum connection interval in milliseconds. */
#define SUPERVISION_TIMEOUT             MSEC_TO_UNITS(4000, UNIT_10_MS)     /**< Determines supervision time-out in units of 10 milliseconds. */
#define UUID16_SIZE                     2                                   /**< Size of a UUID, in bytes. */

#define APP_ADV_INTERVAL                64                                      /**< The advertising interval (in units of 0.625 ms; this value corresponds to 40 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS      BLE_GAP_ADV_TIMEOUT_GENERAL_UNLIMITED   /**< The advertising time-out (in units of seconds). When set to 0, we will never time out. */

#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(10, UNIT_1_25_MS)        /**< Minimum acceptable connection interval 50Hz*/
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(40, UNIT_1_25_MS)        /**< Maximum acceptable connection interval 25Hz*/
#define SLAVE_LATENCY                   0                                       /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)         /**< Connection supervisory time-out (4 seconds). */

#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(20000)                  /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (15 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(5000)                   /**< Time between each call to sd_ble_gap_conn_param_update after the first call (5 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                       /**< Number of attempts before giving up the connection parameter negotiation. */

#define DEAD_BEEF                       0xDEADBEEF                              /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

static uint8_t m_gap_role     = BLE_GAP_ROLE_INVALID;                           /**< BLE role for this connection, see @ref BLE_GAP_ROLES */
static char const m_target_periph_name[] = "Skoobot";                           /**< Name of the device we try to connect to. This name is searched in the scan report data*/
static void on_ble_gap_evt_connected(ble_gap_evt_t const * p_gap_evt);
static void db_disc_handler(ble_db_discovery_evt_t * p_evt);
BLE_DB_DISCOVERY_DEF(m_db_disc);                                                /**< DB discovery module instance. */
/**@brief Parameters used when scanning. */
static ble_gap_scan_params_t const m_scan_params =
{
    .active   = 1,
    .interval = SCAN_INTERVAL,
    .window   = SCAN_WINDOW,
    .timeout  = SCAN_TIMEOUT,
    #if (NRF_SD_BLE_API_VERSION <= 2)
        .selective   = 0,
        .p_whitelist = NULL,
    #endif
    #if (NRF_SD_BLE_API_VERSION >= 3)
        .use_whitelist = 0,
    #endif
};
/**@brief Connection parameters requested for connection. */
static ble_gap_conn_params_t const m_connection_param =
{
    (uint16_t)MIN_CONNECTION_INTERVAL,
    (uint16_t)MAX_CONNECTION_INTERVAL,
    (uint16_t)SLAVE_LATENCY,
    (uint16_t)SUPERVISION_TIMEOUT
};
/**@brief Variable length data encapsulation in terms of length and pointer to data. */
typedef struct
{
    uint8_t * p_data;   /**< Pointer to data. */
    uint16_t  data_len; /**< Length of data. */
} data_t;

void ble_skoobot_p_on_ble_evt(ble_evt_t const * p_ble_evt, void * p_context);
void ble_skoobot_c_on_ble_evt(ble_evt_t const * p_ble_evt, void * p_context);
#define BLE_SKOOBOT_DEF_P(_name)                                                \
static uint8_t _name;                                                         \
NRF_SDH_BLE_OBSERVER(_name ## _obs,                                           \
                     2,                                                       \
                     ble_skoobot_p_on_ble_evt, &_name)
#define BLE_SKOOBOT_DEF_C(_name)                                                \
static uint8_t _name;                                                         \
NRF_SDH_BLE_OBSERVER(_name ## _obs,                                           \
                     2,                                                       \
                     ble_skoobot_c_on_ble_evt, &_name)

//stole these from Nordic Blinky app
#define LBS_UUID_BASE        {0x23, 0xD1, 0xBC, 0xEA, 0x5F, 0x78, 0x23, 0x15, \
                              0xDE, 0xEF, 0x12, 0x12, 0x00, 0x00, 0x00, 0x00}
#define LBS_UUID_SERVICE     0x1523
#define LBS_UUID_DATA_CHAR   0x1524
#define LBS_UUID_CMD_CHAR    0x1525
#define LBS_UUID_BYTE2_CHAR  0x1526
#define LBS_UUID_BYTE128_CHAR 0x1527
#define LBS_UUID_BYTE4_CHAR  0x1528

BLE_SKOOBOT_DEF_P(m_skoobot_p);
BLE_SKOOBOT_DEF_C(m_skoobot_c);
NRF_BLE_GATT_DEF(m_gatt);                                                       /**< GATT module instance. */

// BLE Data, declare and Initialize
ble_uuid_t ble_uuid_svc;
uint16_t m_conn_p_handle = BLE_CONN_HANDLE_INVALID;                      
uint16_t m_conn_c_handle = BLE_CONN_HANDLE_INVALID;                      
uint8_t g_inbyte = 0;
uint16_t svc_handle;
ble_gatts_char_handles_t data_handle, cmd_handle, remote_cmd_handle;
ble_gatts_char_handles_t data_2byte_handle, data_4byte_handle, data_128byte_handle;
uint8_t uuid_type;
uint8_t cmd_value = 0, data_value = 0, BLE_P_Connected = 0, BLE_C_Connected = 0, new_cmd = 0;
uint8_t data_2byte_val[2], data_4byte_val[4];
ble_gatts_value_t sound_value, sound_flag, data4_value, data_val;    //for Raspberry Pi and Samsung phone
uint8_t pi_reads_active = 0, found_skoobot = 0;
//BLE prototype functions
static void timers_init(void);
static void log_init(void);
static void ble_stack_init(void);
static void gap_params_init(void);
static void gatt_init(void);
static void services_init(void);
static void advertising_init(void);
static void conn_params_init(void);
static void advertising_start(void);
static uint32_t add_cmd_characteristic(void);
static uint32_t add_data_characteristic(void);
static uint32_t add_data2_characteristic(void);
static uint32_t add_mult_data_characteristics(void);
static uint32_t add_cmd4_characteristic(void);
static uint32_t update_remote_byte(void);    //sends uint8_t data_value
static uint32_t update_remote_2byte(void);    //sends 2 uint8_t or unit16_t data2_value
static void db_disc_handler(ble_db_discovery_evt_t * p_evt);
static void db_discovery_init(void);
static void scan_start(void);
//len = 128 supported by BLE 4.1 and 4.2, 5.0 (my iPhone6)
//len = 20 supported by BLE 4.0 (my Moto E4)
#define MULTI_LEN 20
uint8_t data_128byte_val[MULTI_LEN];
static uint32_t update_remote_multi_byte(uint32_t i);  
static uint32_t update_remote_multi_byte_dft(uint32_t i);

