bweiler/Skoobot-firmware/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_template/main.c
  pwm_top = 125000 / steps_per_second; 
  if( pwm_top > 0xffff)
    pwm_top = 0xffff;
  pwm_duty[0] = pwm_duty[1] = pwm_top / 2;

  nrf_pwm_event_clear(NRF_PWM0, NRF_PWM_EVENT_LOOPSDONE);
  nrf_pwm_event_clear(NRF_PWM0, NRF_PWM_EVENT_SEQEND0);
  nrf_pwm_event_clear(NRF_PWM0, NRF_PWM_EVENT_SEQEND1);
  nrf_pwm_event_clear(NRF_PWM0, NRF_PWM_EVENT_STOPPED);
  nrf_pwm_shorts_set(NRF_PWM0, NRF_PWM_SHORT_LOOPSDONE_SEQSTART0_MASK);
  nrf_pwm_configure(NRF_PWM0,PWM_PRESCALER_PRESCALER_DIV_128,PWM_MODE_UPDOWN_Up,pwm_top);
  nrf_pwm_seq_ptr_set(NRF_PWM0,0,pwm_duty);
  nrf_pwm_seq_cnt_set(NRF_PWM0,0,1);
  nrf_pwm_seq_ptr_set(NRF_PWM0,1,pwm_duty);
  nrf_pwm_seq_cnt_set(NRF_PWM0,1,1);
  nrf_pwm_loop_set(NRF_PWM0,number_steps / 2);
  nrf_pwm_task_trigger(NRF_PWM0, NRF_PWM_TASK_SEQSTART0);
  step_loop_done = 0;
}

void PWM0_IRQHandler(void)
{
    stop_stepping();
}

void stop_stepping(void)
{
  if (nrf_pwm_event_check(NRF_PWM0, NRF_PWM_EVENT_LOOPSDONE))
  {
    nrf_pwm_event_clear(NRF_PWM0, NRF_PWM_EVENT_LOOPSDONE);  
    if (nrf_pwm_event_check(NRF_PWM0, NRF_PWM_EVENT_STOPPED) == 0)
    {
        nrf_pwm_task_trigger(NRF_PWM0, NRF_PWM_TASK_STOP);
        while(nrf_pwm_event_check(NRF_PWM0, NRF_PWM_EVENT_STOPPED) == 0);
        step_loop_done = 1;
    }
  }
}
#endif

void PWM1_IRQHandler(void)
{
    stop_buzzer();
}
//125000/freq=    125000/250
void pwm_buzzer_frequency(float32_t freq, uint32_t loops)
{
  float32_t main_freq;
  volatile static uint16_t pwm_top, pwm_duty[2];
   
  main_freq = 125000.0 / freq;

  pwm_top = (uint16_t)main_freq;
  pwm_duty[0] = pwm_duty[1] = (uint16_t)(main_freq / 2.0);

  nrf_pwm_event_clear(NRF_PWM1, NRF_PWM_EVENT_LOOPSDONE);
  nrf_pwm_event_clear(NRF_PWM1, NRF_PWM_EVENT_SEQEND0);
  nrf_pwm_event_clear(NRF_PWM1, NRF_PWM_EVENT_SEQEND1);
  nrf_pwm_event_clear(NRF_PWM1, NRF_PWM_EVENT_STOPPED);
  nrf_pwm_shorts_set(NRF_PWM1, NRF_PWM_SHORT_LOOPSDONE_SEQSTART0_MASK);
  nrf_pwm_configure(NRF_PWM1,PWM_PRESCALER_PRESCALER_DIV_128,PWM_MODE_UPDOWN_Up,pwm_top);
  nrf_pwm_seq_ptr_set(NRF_PWM1,0,pwm_duty);
  nrf_pwm_seq_cnt_set(NRF_PWM1,0,1);
  nrf_pwm_seq_ptr_set(NRF_PWM1,1,pwm_duty);
  nrf_pwm_seq_cnt_set(NRF_PWM1,1,1);
  nrf_pwm_loop_set(NRF_PWM1,loops / 2);
  nrf_pwm_task_trigger(NRF_PWM1, NRF_PWM_TASK_SEQSTART0);
  buzzer_loops_done = 0;
}

//just toggles gpios for now
void mb_test(void)
{
  static uint8_t range;

  nrf_gpio_cfg_output(MIC_CLK);
  nrf_gpio_cfg_output(MIC_DI);
  nrf_gpio_cfg_output(SLEEP);
  
  for(;;)
  {
    led_on();
    nrf_gpio_pin_clear(STEP);
    nrf_gpio_pin_clear(DIR_L);
    nrf_gpio_pin_clear(DIR_R);
    nrf_gpio_pin_clear(M1);
    nrf_gpio_pin_clear(M0);
    nrf_gpio_pin_clear(MIC_CLK);
    nrf_gpio_pin_clear(MIC_DI);
    nrf_gpio_pin_clear(SLEEP);
    nrf_delay_ms(500);
    led_off();
    nrf_gpio_pin_set(STEP);
    nrf_gpio_pin_set(DIR_L);
    nrf_gpio_pin_set(DIR_R);
    nrf_gpio_pin_set(M1);
    nrf_gpio_pin_set(M0);
    nrf_gpio_pin_set(MIC_CLK);
    nrf_gpio_pin_set(MIC_DI);
    nrf_gpio_pin_set(SLEEP);
    nrf_delay_ms(500);
    range = getDistance();
    sprintf(buf_out,"Range is %d\r\n",range);
    TxUART(buf_out);

    nrf_delay_ms(500);
  }
}

void stop_buzzer(void)
{
  if (nrf_pwm_event_check(NRF_PWM1, NRF_PWM_EVENT_LOOPSDONE))
  {
    nrf_pwm_event_clear(NRF_PWM1, NRF_PWM_EVENT_LOOPSDONE);  
    if (nrf_pwm_event_check(NRF_PWM1, NRF_PWM_EVENT_STOPPED) == 0)
    {
        nrf_pwm_task_trigger(NRF_PWM1, NRF_PWM_TASK_STOP);
        while(nrf_pwm_event_check(NRF_PWM1, NRF_PWM_EVENT_STOPPED) == 0);
        buzzer_loops_done = 1;
    }
  }
}

void uart_init(void)
{
  nrf_uarte_baudrate_set(NRF_UARTE0,NRF_UARTE_BAUDRATE_115200); 
  nrf_uarte_txrx_pins_set(NRF_UARTE0,UART_TX_PIN,UART_RX_PIN);
  nrf_uarte_configure(NRF_UARTE0,NRF_UARTE_PARITY_EXCLUDED,NRF_UARTE_HWFC_DISABLED);  //no parity, no hw flow control
  nrf_uarte_rx_buffer_set(NRF_UARTE0,buf_in,UART_LEN_LIMIT);
  nrf_uarte_tx_buffer_set(NRF_UARTE0,buf_out,UART_LEN_LIMIT);
  nrf_uarte_enable(NRF_UARTE0);
}

void my_configure(void)
{
  nrf_gpio_cfg_output(DIR_L);
  nrf_gpio_cfg_output(DIR_R);
  nrf_gpio_cfg_output(SLEEP);
  motors_sleep();               
  motors_forward();
  stepping_mode(HALF_STEP);         

  nrf_gpio_pin_clear(STEP);
  nrf_gpio_cfg_output(STEP);

#if MOTORS_STEPPING_PWM
  NRF_PWM0->PSEL.OUT[0] = STEP;

  nrf_pwm_enable(NRF_PWM0);
  nrf_pwm_configure(NRF_PWM0,PWM_PRESCALER_PRESCALER_DIV_128,PWM_MODE_UPDOWN_Up,1000);
  nrf_pwm_loop_set(NRF_PWM0,0);
  nrf_pwm_decoder_set(NRF_PWM0,PWM_DECODER_LOAD_Common,PWM_DECODER_MODE_RefreshCount);
  nrf_pwm_seq_refresh_set(NRF_PWM0,0,0);
  nrf_pwm_seq_end_delay_set(NRF_PWM0,0,0);
  nrf_pwm_seq_refresh_set(NRF_PWM0,1,0);
  nrf_pwm_seq_end_delay_set(NRF_PWM0,1,0);
  nrf_pwm_shorts_set(NRF_PWM0, 0);
  nrf_pwm_event_clear(NRF_PWM0, NRF_PWM_EVENT_LOOPSDONE);
  nrf_pwm_event_clear(NRF_PWM0, NRF_PWM_EVENT_SEQEND0);
  nrf_pwm_event_clear(NRF_PWM0, NRF_PWM_EVENT_SEQEND1);
  nrf_pwm_event_clear(NRF_PWM0, NRF_PWM_EVENT_STOPPED);
  nrf_pwm_int_set(NRF_PWM0, NRF_PWM_INT_LOOPSDONE_MASK);
  nrf_drv_common_irq_enable(PWM0_IRQn,APP_IRQ_PRIORITY_LOWEST);
#else
  //use gpio STEP and timer1
  nrf_timer_event_clear(NRF_TIMER1,NRF_TIMER_EVENT_COMPARE0);
  nrf_timer_mode_set(NRF_TIMER1,NRF_TIMER_MODE_TIMER);
  nrf_timer_bit_width_set(NRF_TIMER1,NRF_TIMER_BIT_WIDTH_32);
  nrf_timer_frequency_set(NRF_TIMER1,NRF_TIMER_FREQ_125kHz);
  nrf_timer_cc_write(NRF_TIMER1,NRF_TIMER_CC_CHANNEL0,25);        // 200us per interrupt
  nrf_timer_int_enable(NRF_TIMER1,NRF_TIMER_INT_COMPARE0_MASK);
  nrf_drv_common_irq_enable(TIMER1_IRQn,APP_IRQ_PRIORITY_LOWEST);
#endif

  nrf_gpio_pin_clear(BUZZER_10MM);
  nrf_gpio_cfg_output(BUZZER_10MM);
  NRF_PWM1->PSEL.OUT[0] = BUZZER_10MM;

  nrf_pwm_enable(NRF_PWM1);
  nrf_pwm_configure(NRF_PWM1,PWM_PRESCALER_PRESCALER_DIV_128,PWM_MODE_UPDOWN_Up,1000);
  nrf_pwm_loop_set(NRF_PWM1,0);
  nrf_pwm_decoder_set(NRF_PWM1,PWM_DECODER_LOAD_Common,PWM_DECODER_MODE_RefreshCount);
  nrf_pwm_seq_refresh_set(NRF_PWM1,0,0);
  nrf_pwm_seq_end_delay_set(NRF_PWM1,0,0);
  nrf_pwm_seq_refresh_set(NRF_PWM1,1,0);
  nrf_pwm_seq_end_delay_set(NRF_PWM1,1,0);
  nrf_pwm_shorts_set(NRF_PWM1, 0);
  nrf_pwm_event_clear(NRF_PWM1, NRF_PWM_EVENT_LOOPSDONE);
  nrf_pwm_event_clear(NRF_PWM1, NRF_PWM_EVENT_SEQEND0);
  nrf_pwm_event_clear(NRF_PWM1, NRF_PWM_EVENT_SEQEND1);
  nrf_pwm_event_clear(NRF_PWM1, NRF_PWM_EVENT_STOPPED);
  nrf_pwm_int_set(NRF_PWM1, NRF_PWM_INT_LOOPSDONE_MASK);
  nrf_drv_common_irq_enable(PWM1_IRQn,APP_IRQ_PRIORITY_LOWEST);
}

//expects null terminated string, so use sprintf for buf
void TxUART(uint8_t* sendbuffer)
{
    uint8_t j;

    j=0;
    while(sendbuffer[j] != 0)
    {
        ++j;
        if (j > UART_LEN_LIMIT)
        {
          j = UART_LEN_LIMIT;
          break;
        }
    }
    nrf_uarte_tx_buffer_set(NRF_UARTE0,sendbuffer,j);
    nrf_uarte_event_clear(NRF_UARTE0,NRF_UARTE_EVENT_ENDTX);
    nrf_uarte_task_trigger(NRF_UARTE0,NRF_UARTE_TASK_STARTTX);
    while( nrf_uarte_event_check(NRF_UARTE0,NRF_UARTE_EVENT_ENDTX) == 0);   //This blocks on transmit, maybe fix for parallelism
    nrf_uarte_event_clear(NRF_UARTE0,NRF_UARTE_EVENT_ENDTX);
}

void TxUART_DFT(void)
{
  uint8_t i;
 
  for(i=0;(i<FFT_TEST_OUT_SAMPLES_LEN);i++)
  {
      sprintf(buf_out,"%d,",p_out_buffer[i]);
      TxUART(buf_out);
  }
  TxUART("\r\n");
}
/**
 * @brief Function for processing generated sine wave samples.
 * @param[in] p_input        Pointer to input data array with complex number samples in time domain.
 * @param[in] p_input_struct Pointer to cfft instance structure describing input data.
 * @param[out] p_output      Pointer to processed data (bins) array in frequency domain.
 * @param[in] output_size    Processed data array size.
 */
static void fft_process(float32_t *                   p_input,
                        const arm_cfft_instance_f32 * p_input_struct,
                        float32_t *                   p_output,
                        uint16_t                      output_size)
{
    // Use CFFT module to process the data.
    arm_cfft_f32(p_input_struct, p_input, m_ifft_flag, m_do_bit_reverse);
    // Calculate the magnitude at each bin using Complex Magnitude Module function.
    arm_cmplx_mag_f32(p_input, p_output, output_size);
}

//coming into fft, input sample with be 1 second of mono, or 16,000 int16_t values. The fft takes only 64
//inputs from this. I will start in the middle, like at 800.
//The input of the fft is 64 sound values, plus "fake" imaginary of 0 degrees, for 64 pairs, or 128 floats.
//The output is 128, but these are duplicated symetrically, so only first 64 are useful.
void do_dft(void)
{
    uint32_t i;
    uint32_t  max_val_index;
    float32_t max_value, normal_value;

    //Make 64 complex numbers from center of sound file
    for(i=0;(i<FFT_TEST_COMP_SAMPLES_LEN);i+=2)
    {
          m_fft_input_f32[i] = p_rx_buffer[i+800];      //magnitude part 
          m_fft_input_f32[i+1] = 0;                     //fake 0 degrees imaginary part             
    }

    // Process generated data. 64 pairs of complex data (real, img). It is important to use
    // proper arm_cfft_sR_f32 structure associated with input/output data length.
    // For example:
    //  - 128 numbers in input array (64 complex pairs of samples) -> 64 output bins power data -> &arm_cfft_sR_f32_len64.
    //  - 256 numbers in input array (128 complex pairs of samples) -> 128 output bins power data -> &arm_cfft_sR_f32_len128.
    fft_process(m_fft_input_f32,
                &arm_cfft_sR_f32_len64,
                m_fft_output_f32,
                FFT_TEST_OUT_SAMPLES_LEN);
 
    //zap dc component
    m_fft_output_f32[0] = 0;

