bweiler/Skoobot-firmware/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_template/main.c
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.write_perm);
    cccd_md.vloc = BLE_GATTS_VLOC_STACK;

    memset(&char_md, 0, sizeof(char_md));

    char_md.char_props.read   = 1;
    char_md.char_props.notify = 1;
    char_md.p_char_user_desc  = NULL;
    char_md.p_char_pf         = NULL;
    char_md.p_user_desc_md    = NULL;
    char_md.p_cccd_md         = &cccd_md;
    char_md.p_sccd_md         = NULL;

    ble_uuid.type = uuid_type;
    ble_uuid.uuid = LBS_UUID_BYTE2_CHAR;

    memset(&attr_md, 0, sizeof(attr_md));

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.write_perm);
    attr_md.vloc    = BLE_GATTS_VLOC_STACK;
    attr_md.rd_auth = 0;
    attr_md.wr_auth = 0;
    attr_md.vlen    = 0;

    memset(&attr_char_value, 0, sizeof(attr_char_value));

    attr_char_value.p_uuid    = &ble_uuid;
    attr_char_value.p_attr_md = &attr_md;
    attr_char_value.init_len  = 2;
    attr_char_value.init_offs = 0;
    attr_char_value.max_len   = 2;
    attr_char_value.p_value   = NULL;

    return sd_ble_gatts_characteristic_add(svc_handle,
                                           &char_md,
                                           &attr_char_value,
                                           &data_2byte_handle);   
}
/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    ret_code_t     err_code;
  
  // Add service.
    ble_uuid128_t base_uuid = {LBS_UUID_BASE};
    err_code = sd_ble_uuid_vs_add(&base_uuid, &uuid_type);
    APP_ERROR_CHECK(err_code);

    ble_uuid_svc.uuid = LBS_UUID_SERVICE;
    ble_uuid_svc.type = uuid_type;

    err_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY, &ble_uuid_svc, &svc_handle);
    APP_ERROR_CHECK(err_code);
       
    err_code = add_cmd_characteristic();
    APP_ERROR_CHECK(err_code);
    
    err_code = add_data_characteristic();
    APP_ERROR_CHECK(err_code);

    err_code = add_data2_characteristic();
    APP_ERROR_CHECK(err_code);
    
    err_code = add_cmd4_characteristic();
    APP_ERROR_CHECK(err_code);
 
    err_code = add_mult_data_characteristics();
    APP_ERROR_CHECK(err_code);
}

static uint32_t update_remote_byte(void)
{
    ble_gatts_hvx_params_t params;
    uint16_t len = 1;

    memset(&params, 0, sizeof(params));
    params.type   = BLE_GATT_HVX_NOTIFICATION;
    params.handle = data_handle.value_handle;
    params.p_data = &data_value;
    params.p_len  = &len;

    return sd_ble_gatts_hvx(m_conn_p_handle, &params);
}

static uint32_t update_remote_2byte(void)
{
    ble_gatts_hvx_params_t params;
    uint16_t len = 2;

    data_2byte_val[0] = (uint8_t)(data2_value>>8)&0x00ff;
    data_2byte_val[1] = (uint8_t)(data2_value&0x00ff);

    memset(&params, 0, sizeof(params));
    params.type   = BLE_GATT_HVX_NOTIFICATION;
    params.handle = data_2byte_handle.value_handle;
    params.p_data = data_2byte_val;
    params.p_len  = &len;

    return sd_ble_gatts_hvx(m_conn_p_handle, &params);
}

//Connection interval set to 50Hz, higher needs better signal strength
//Each 20ms period, we send 128 bytes, it takes .02s*(32k/128)=5.12s
static uint32_t update_remote_multi_byte(uint32_t index)
{
    ble_gatts_hvx_params_t params;
    uint16_t len = MULTI_LEN;
    uint16_t i, j;

    i = j = 0;
    while(i<len)
    {
      data_128byte_val[i+1] = (uint8_t)((p_rx_buffer[index+j]>>8)&0x00ff);
      data_128byte_val[i] = (uint8_t)(p_rx_buffer[index+j]&0x00ff);
      i+=2;
      ++j;
    }
    memset(&params, 0, sizeof(params));
    params.type   = BLE_GATT_HVX_NOTIFICATION;
    params.handle = data_128byte_handle.value_handle;
    params.p_data = data_128byte_val;
    params.p_len  = &len;

    return sd_ble_gatts_hvx(m_conn_p_handle, &params);
}

//Connection interval set to 50Hz, higher needs better signal strength
//Each 20ms period, we send 128 bytes, it takes .02s*(32k/128)=5.12s
static uint32_t update_remote_multi_byte_dft(uint32_t index)
{
    ble_gatts_hvx_params_t params;
    uint16_t len = MULTI_LEN;
    uint16_t i, j;

    if (index == 3)
    {
      len = 4;
      for(i=len;(i<MULTI_LEN);i++)
        data_128byte_val[i] = 0;
    }
    i = j = 0;
    while(i<len)
    {
      data_128byte_val[i+1] = (uint8_t)((p_out_buffer[index+j]>>8)&0x00ff);
      data_128byte_val[i] = (uint8_t)(p_out_buffer[index+j]&0x00ff);
      i+=2;
      ++j;
    }
    memset(&params, 0, sizeof(params));
    params.type   = BLE_GATT_HVX_NOTIFICATION;
    params.handle = data_128byte_handle.value_handle;
    params.p_data = data_128byte_val;
    params.p_len  = &len;

    return sd_ble_gatts_hvx(m_conn_p_handle, &params);
}

/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module that
 *          are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply
 *       setting the disconnect_on_fail config parameter, but instead we use the event
 *       handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    ret_code_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_p_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    ret_code_t             err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

