bweiler/Skoobot-firmware/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_template/main.c
    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    ret_code_t           err_code;
    ble_gap_adv_params_t adv_params;

    // Start advertising
    memset(&adv_params, 0, sizeof(adv_params));

    adv_params.type        = BLE_GAP_ADV_TYPE_ADV_IND;
    adv_params.p_peer_addr = NULL;
    adv_params.fp          = BLE_GAP_ADV_FP_ANY;
    adv_params.interval    = APP_ADV_INTERVAL;
    adv_params.timeout     = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = sd_ble_gap_adv_start(&adv_params, APP_BLE_CONN_CFG_TAG);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling BLE_GAP_EVT_CONNECTED events.
 * Save the connection handle and GAP role, then discover the peer DB.

static void on_ble_gap_evt_connected(ble_gap_evt_t const * p_gap_evt)
{
    ret_code_t err_code;

 
}
*/
/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    ret_code_t err_code;
    uint16_t i, j;

    ble_gap_evt_t const * p_gap_evt = &p_ble_evt->evt.gap_evt;
    m_gap_role = p_gap_evt->params.connected.role;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
        {
            if (m_gap_role == BLE_GAP_ROLE_PERIPH)
            {
              (void) sd_ble_gap_adv_stop();
              m_conn_p_handle = p_gap_evt->conn_handle;
              TxUART("Connected Peripheral\r\n");
              BLE_P_Connected = 1;
            }
            else
            {
              if (m_gap_role == BLE_GAP_ROLE_CENTRAL)
              {
                m_conn_c_handle = p_gap_evt->conn_handle;
                err_code = ble_db_discovery_start(&m_db_disc, p_gap_evt->conn_handle);
                APP_ERROR_CHECK(err_code);
                BLE_C_Connected = 1;
                TxUART("Connect Central\r\n");
              }
            }
        }
            break;
        
        case BLE_GAP_EVT_DISCONNECTED:
        {
            if (p_gap_evt->conn_handle == m_conn_p_handle)
            {
              TxUART("Disconnected peripheral\r\n");
              m_conn_p_handle = BLE_CONN_HANDLE_INVALID;
              BLE_P_Connected = 0;
              advertising_start();
            }
            else
            {
              if (p_gap_evt->conn_handle == m_conn_c_handle)
              {
                TxUART("Disconnected central\r\n");
                m_conn_c_handle = BLE_CONN_HANDLE_INVALID;
                BLE_C_Connected = 0;
              }
            }
       }
            break;
       case BLE_GAP_EVT_ADV_REPORT:
            
            on_adv_report(p_ble_evt);
            break;

        case BLE_GAP_EVT_TIMEOUT:
            // We have not specified a timeout for scanning, so only connection attemps can timeout.
            if (p_gap_evt->params.timeout.src == BLE_GAP_TIMEOUT_SRC_CONN)
            {
                TxUART("Connection request timed out.\r\n");
            }
            break;

        case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:
        
            // Accept parameters requested by peer.
            err_code = sd_ble_gap_conn_param_update(p_gap_evt->conn_handle,
                                        &p_gap_evt->params.conn_param_update_request.conn_params);
            APP_ERROR_CHECK(err_code);
            break;
        
        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
            // Pairing not supported

            err_code = sd_ble_gap_sec_params_reply(p_ble_evt->evt.gap_evt.conn_handle,
                                                   BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP,
                                                   NULL,
                                                   NULL);
            APP_ERROR_CHECK(err_code);
            break;

#ifndef S140
        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
            ble_gap_phys_t const phys =
            {
                .rx_phys = BLE_GAP_PHY_AUTO,
                .tx_phys = BLE_GAP_PHY_AUTO,
            };
            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            APP_ERROR_CHECK(err_code);
        } break;
#endif

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
            // No system attributes have been stored.
            err_code = sd_ble_gatts_sys_attr_set(p_ble_evt->evt.gap_evt.conn_handle, NULL, 0, 0);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTC_EVT_TIMEOUT:
            // Disconnect on GATT Client timeout event.
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_EVT_USER_MEM_REQUEST:
            err_code = sd_ble_user_mem_reply(p_ble_evt->evt.gattc_evt.conn_handle, NULL);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST:
        {
            static ble_gatts_evt_rw_authorize_request_t  req;
            static ble_gatts_rw_authorize_reply_params_t auth_reply;

            req = p_ble_evt->evt.gatts_evt.params.authorize_request;

            if (req.type == BLE_GATTS_AUTHORIZE_TYPE_READ && req.request.read.handle == data_128byte_handle.value_handle)
            {
              if (pi_reads_active == 1)
              {
                  //This is a little tricky, i increments by 2 and goes to 20, j increments by 1 and goes to 10
                  i = j = 0;
                  while(i<MULTI_LEN)
                  {
                    data_128byte_val[i+1] = (uint8_t)((p_rx_buffer[load_buffer_offset+j]>>8)&0x00ff);
                    data_128byte_val[i] = (uint8_t)(p_rx_buffer[load_buffer_offset+j]&0x00ff);
                    i+=2;
                    ++j;
                  }
                  //sound_value.offset = 0;
                  //sound_value.len = 20;
                  //sound_value.p_value = data_128byte_val;
                  //sd_ble_gatts_value_set(m_conn_handle,data_128byte_handle.value_handle,&sound_value);
                  
