bweiler/Skoobot-firmware/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_template/main.c
                  load_buffer_offset += MULTI_LEN/2; //increment by 10
  
                  auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
                  auth_reply.params.read.gatt_status = BLE_GATT_STATUS_SUCCESS;
                  auth_reply.params.read.update = 1;
                  auth_reply.params.read.len = MULTI_LEN;
                  auth_reply.params.read.offset = 0;
                  auth_reply.params.read.p_data = data_128byte_val;
                  err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                               &auth_reply);
                  if (err_code != NRF_SUCCESS)
                  {
                    load_buffer_offset -= MULTI_LEN/2;    //decrement for retry, does NRF do retry after failure?
                  }                 
                  return;
              }
              else  //if it gets here, it is a startup or discovery read, must be authorized.
              {
                  memset(&auth_reply,0,sizeof(ble_gatts_rw_authorize_reply_params_t));
                  auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
                  auth_reply.params.read.gatt_status = BLE_GATT_STATUS_SUCCESS;
                  err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                               &auth_reply);
                  return; 
              }
            }
            if (req.type != BLE_GATTS_AUTHORIZE_TYPE_INVALID)
            {
                if ((req.request.write.op == BLE_GATTS_OP_PREP_WRITE_REQ)     ||
                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_NOW) ||
                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_CANCEL))
                {
                    if (req.type == BLE_GATTS_AUTHORIZE_TYPE_WRITE)
                    {
                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
                    }
                    else
                    {
                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
                    }
                    auth_reply.params.write.gatt_status = APP_FEATURE_NOT_SUPPORTED;
                    err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                               &auth_reply);
                    return;
                }
            }
        }
        break; // BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST

      default:
        // No implementation needed.
        break;
    }
}

void on_write(ble_evt_t const * p_ble_evt)
{    
    ble_gatts_evt_write_t const * p_evt_write = &p_ble_evt->evt.gatts_evt.params.write;
 
    if (p_evt_write->handle == cmd_handle.value_handle)
    {
        if (p_evt_write->len == 1)
        {
          cmd_value = p_evt_write->data[0];
          new_cmd = 1;
          sprintf(buf_out,"cmd = %x\r\n",cmd_value);
          TxUART(buf_out);
        }
        else
        {
          sprintf(buf_out,"cmd %x but wrong length = %d\r\n",cmd_value,p_evt_write->len);
          TxUART(buf_out);
        }
    }else{
        if (p_evt_write->handle == data_4byte_handle.value_handle)
        {
          if (p_evt_write->len == 4)
          {
           cmd_value = p_evt_write->data[0];
           motors_speed = (((uint16_t)p_evt_write->data[1])<<8) | p_evt_write->data[2];
           motors_code = p_evt_write->data[3]; //not sure what to do with this yet
           new_cmd = 1;
           sprintf(buf_out,"cmd = %x speed = %d code = %d\r\n",cmd_value,motors_speed,motors_code);
           TxUART(buf_out);
          }else{
           sprintf(buf_out,"4 byte command wrong length = %d\r\n",p_evt_write->len);
           TxUART(buf_out);
          }
        }else{
          if (p_evt_write->handle == data_handle.value_handle)
          {
            new_cmd = 2;
            sprintf(buf_out,"data, unexpected write, handle %d, len = %d\r\n",p_evt_write->handle,p_evt_write->len);
            TxUART(buf_out);
          }else{
            sprintf(buf_out,"Unexpected write, handle %d len %d\r\n",p_evt_write->handle,p_evt_write->len);
            TxUART(buf_out);
          }
        }
    }
}

void ble_skoobot_p_on_ble_evt(ble_evt_t const * p_ble_evt, void * p_context)
{

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GATTS_EVT_WRITE:
            on_write(p_ble_evt);
            break;

        default:
            // No implementation needed.
            break;
    }
}

void ble_skoobot_c_on_ble_evt(ble_evt_t const * p_ble_evt, void * p_context)
{

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GATTS_EVT_WRITE:
            break;

        default:
            // No implementation needed.
            break;
    }
}

/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}

void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);
}


/*
*@brief Function for the Power Manager.
 */
void power_manage(void)
{
    ret_code_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

/*
*@brief Function for the Timer initialization.
 */
void timers_init(void)
{
    // Initialize timer module, making it use the scheduler
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}